// /config.js
(function (w) {
    // 如果 env-config.js 已经设置了 WEB_BASE，就使用它；否则使用默认值
    if (!w.WEB_BASE) {
        w.WEB_BASE = "https://dialects.yzup.top"
        w.API_BASE = w.WEB_BASE + '/api';
    }
})(window);

const allow_chars_status = new Set([
    "攝","摄","呼","等","韻","韵","入","調","调","清","濁","浊","系","組","组","母",
    "假","咸","宕","山","效","曾","果","梗","止","江","流","深","臻","蟹","通","遇",
    "合","開","开","一","三","二","四","之","仙","佳","侯","侵","元","先","冬","凡","刪","删",
    "咍","唐","嚴","严","夬","宵","寒","尤","幽","庚","廢","废","微","支","文","東","东","桓","模",
    "欣","歌","泰","添","灰","痕","登","皆","真","祭","耕","肴","脂","蒸","蕭","萧","虞","覃",
    "談","谈","豪","銜","衔","鍾","钟","陽","阳","青","魂","魚","鱼","鹽","盐","麻","齊","齐",
    "舒","上","去","平","全","次","幫","帮","知","端","見","见","影","日","曉","晓","泥","章",
    "精","莊","庄","非","並","并","云","雲","以","來","来","初","匣","奉","娘","定","崇","常",
    "從","从","徹","彻","心","敷","昌","明","書","书","溪","滂","澄","生","疑","禪","禅","群","船","透","邪",
    "部", "位", "方", "式", "俟", "齶", "脣", "锐", "銳", "齿", "卷", "软", "双", "A", "B", "C",
    "唇", "齒", "喉", "捲", "舌", "腭", "軟", "雙", "塞", "擦", "近", "鼻",
    "@", "-", "#", "*"," ", "\n", ";"," ,", "\t"
]);

const allow_chars_groups = new Set([
    "攝","摄","呼","等","韻","韵","入","調","调","清","濁","浊","系","組","组","母","部", "位", "方", "式", " ", "\n", ";"," ,", "\t"
]);
const column_values= {
    '攝': ['通', '江', '止', '遇', '蟹', '臻', '山', '效', '假', '果', '宕', '梗', '曾', '流', '深', '咸'],
    '韻': ['東', '冬', '鍾', '江', '支', '脂', '之', '微', '魚', '虞', '模', '齊', '佳', '皆', '灰', '咍', '真', '臻',
        '文', '欣', '元', '魂', '痕', '寒', '刪', '山', '先', '仙', '蕭', '宵', '肴', '豪', '歌', '麻', '陽', '唐',
        '庚', '耕', '清', '青', '蒸', '登', '尤', '侯', '幽', '侵', '覃', '談', '鹽', '添', '咸', '銜', '嚴', '凡',
        '泰', '夬', '廢', '祭'],
    '等': ['一', '二', '三', '三A', '三B', '三C', '三銳', '四'],
    '呼': ['開', '合'],
    '清濁': ['全清', '次清', '全濁', '次濁'],
    '系': ['幫', '端', '知', '見'],
    '組': ['幫', '非', '端', '知', '精', '莊', '章', '見', '影', '曉', '日', '泥'],
    '母': ['幫', '滂', '並', '明', '非', '敷', '奉', '微', '端', '透', '定', '泥', '知', '徹', '澄', '娘', '精', '清',
        '從', '心', '邪', '莊', '初', '崇', '生', '俟', '章', '昌', '船', '書', '常', '見', '溪', '群', '疑', '影',
        '曉', '匣', '云', '以', '日', '來'],
    '入': ['舒', '入'],
    '調': ['平', '上', '去', '入'],
    '部位': ['雙唇', '唇齒', '齒', '捲舌', '腭', '軟腭', '喉'],
    '方式': ['塞', '塞擦', '擦', '近', '鼻']
}

const S2T_T2S_MAPPING = {
    // 簡到繁
    '东': '東', '严': '嚴', '书': '書', '从': '從', '删': '刪', '帮': '幫',
    '并': '並', '庄': '莊', '废': '廢', '开': '開', '彻': '徹', '晓': '曉',
    '来': '來', '浊': '濁', '盐': '鹽', '禅': '禪', '萧': '蕭', '衔': '銜',
    '见': '見', '谈': '談', '阳': '陽', '鱼': '魚', '齐': '齊', '钟': '鍾',
    '锐': '銳', '齿': '齒', '卷': '捲', '软': '軟', '双': '雙',
    // 繁到简
    '孃': '娘', '眞': '真', '羣': '群', '閤': '合', '雲': '云', '餚': '肴',
    '鹹': '咸', '鼕': '冬', '脣': '唇', '齶': '腭',
    "摄": "攝", "呼": "呼", "等": "等", "韵": "韻", "入": "入",
    "调": "調", "清浊": "清濁", "系": "系", "组": "組", "母": "母",
}